using MVC_App.Models.DB;

namespace MVC_App.Models.Lib
{
    public class MyFunc
    {
        public static void CreateBb(ShopDB db)
        {
            db.Categories.Add(new Category() { Name = "Смартфони" });
            db.Categories.Add(new Category() { Name = "Ноутбуки" });
            db.Categories.Add(new Category() { Name = "Побутова техніка" });
            db.SaveChanges();
            var c1 = db.Categories.FirstOrDefault(c => c.Name == "Ноутбуки");
            var c2 = db.Categories.FirstOrDefault(c => c.Name == "Смартфони");
            var c3 = db.Categories.FirstOrDefault(c => c.Name == "Побутова техніка");
            db.Products.Add(new Product()
            {
                Name = "Acer Aspire 7 A715-42G-R0VS (NH.QBFEU.00A) Charcoal Black",
                Price = 29999,
                Details = "Корпус Колір Чорний" +
                          "Вага 2.15 кг" +
                          "Ємність акумулятора 48 Вт * год " +
                          "Маніпулятори Тачпад" +
                          "Характеристики батареї 3 - коміркова, 48 Вт * год" +
                          "Габарити(Ш х Г х В) 363.4 x 254.5 x 22.9 мм" +
                          "Екран Діагональ екрана 15.6(1920x1080) Full HD" +
                          "Тип екрана IPS" +
                          "Роздільна здатність 1920x1080" +
                          "Частота оновлення екрана 60 Гц " +
                          "Процесор Шестиядерний AMD Ryzen 5 5500U(2.1 - 4.0 ГГц)" +
                          "Операційна система Без ОС" +
                          "Оперативна пам'ять Обсяг оперативної пам'яті 8 ГБ" +
                          "Кількість слотів для оперативної пам'яті 2" +
                          "Тип оперативної пам'яті DDR4 - 3200 МГц" +
                          "Під'єднання Мережеві адаптери Wi - Fi 802.11ax Bluetooth 5.1 Gigabit Ethernet" +
                          "Роз'єми та порти введення-виведення 1 x USB 3.2 Type - C Gen 1 / 2 x USB 3.2 Gen 1 / 1 x USB 2.0 / HDMI / LAN(RJ - 45) / комбінований аудіороз'єм для навушників/мікрофона" +
                          "Безпровідний зв'язок Bluetooth 5.1 Wi - Fi 6" +
                          "Відеокарта Обсяг пам'яті відеокарти 4 ГБ" +
                          "Відеокарта NVIDIA GeForce GTX 1650." +
                          "Короткі характеристики:" +
                          "Екран 15.6 IPS (1920x1080) Full HD, матовий/AMD Ryzen 5 5500U (2.1 - 4.0 ГГц)/RAM 8 ГБ/SSD 512 ГБ/nVidia GeForce GTX 1650, 4 ГБ/без ОД/LAN/Wi-Fi/Bluetooth/вебкамера/без ОС/2.15 кг/чорний" +
                          "Додатково: " +
                          "Ідентифікація відбитка пальця" +
                          "З Українською розкладкою" +
                          "З підсвіткою клавіатури " +
                          "Вид" +
                          "Ноутбуки" +
                          "Додаткові можливості" +
                          "Вебкамера HD" +
                          "Вбудований мікрофон" +
                          "Стереодинаміки" +
                          "Сканер відбитків пальців(працює тільки під керуванням Windows)" +
                          "Країна - виробник Китай",
                Image = @"https://content.rozetka.com.ua/goods/images/big/163386254.jpg",
                category = c1
            });
            db.Products.Add(new Product()
            {
                Name = "Lenovo V14 G2 ALC (82KC003NRA) Black",
                Price = 18889,
                Details = "Корпус Колір Чорний Вага 1.6 кг Ємність акумулятора 38 Вт * год Час автономної роботи 7.5 годин(MobileMark 2018) Маніпулятори Тачпад Характеристики батареї 38 Вт * год Габарити(Ш х Г х В) 324.2 x 215.2 x 19.9 мм Матеріал корпусу Пластик Екран Діагональ екрана 14 (1920x1080) Full HD  Тип екрана  TN + film Роздільна здатність 1920x1080 Частота оновлення екрана 60 Гц" +
                          "Вбудована камера 720p Процесор Процесор Шестиядерний AMD Ryzen 5 5500U(2.1 - 4.0 ГГц) Операційна система DOS Чипсет AMD SoC Оперативна пам'ять Обсяг оперативної пам'яті 8 ГБ Кількість слотів для оперативної пам'яті 1 Тип оперативної пам'яті DDR4 - 3200 МГц" +
                          "Накопичувачі даних Кількість слотів M.2 1 Стандарт інтерфейсу SSD M.2 PCI Express 3.0 x4 Кількість відсіків 2.5 SATA для HDD/SSD 1 Під'єднання Мережеві адаптери Wi - Fi " +
                          "802.11ac Bluetooth 5.0 Gigabit Ethernet Роз'єми та порти введення-виведення 1 x USB 2.0 / 1 x USB Type - C 3.2 Gen 1 / 1 x USB 3.2 Gen 1 / HDMI / LAN(RJ - 45) / комбінований аудіороз'єм для навушників/мікрофона " +
                          "Безпровідний зв'язок Bluetooth 5.0 Wi - Fi 5 Відеокарта Відеокарта Інтегрована відеокарта Короткі характеристики Екран 14 TN (1920x1080) Full HD, матовий/AMD Ryzen 5 5500U (2.1 - 4.0 ГГц)/RAM 8 ГБ/SSD 256 ГБ/AMD Radeon Graphics/без ОД/LAN/Wi-Fi/Bluetooth/вебкамера/DOS/1.6 кг/чорний Вид Ноутбуки Додаткові можливості Вебкамера Вбудований мікрофон " +
                          "Вбудовані динаміки Країна - виробник Китай Комплект постачання Ноутбук Адаптер живлення Документація Гарантія 12 місяців",
                Image = @"https://content.rozetka.com.ua/goods/images/big/252192898.jpg",
                category = c1
            });
            db.Products.Add(new Product()
            {
                Name = "HP Pavilion Gaming 15-ec2024ua (5A0U9EA) Shadow Black",
                Price = 44999,
                Details = "Корпус Колір Чорний Вага 1.98 кг Ємність акумулятора 52.5 Вт * год Маніпулятори Тачпад Характеристики батареї 3 - коміркова, літій - іонний полімерна, 52.5 Вт * год " +
                          "Габарити(Ш х Г х В) 360 x 257 x 23.5 мм Екран Діагональ екрана 15.6 (1920x1080) Full HD Тип екрана IPS Роздільна здатність 1920x1080 Частота оновлення екрана 144 Гц " +
                          "Процесор Процесор Восьмиядерний AMD Ryzen 7 5800H(3.2 — 4.4 ГГц) Операційна система DOS Оперативна пам'ять Обсяг оперативної пам'яті 16 ГБ Кількість слотів для оперативної пам'яті 2 " +
                          "Тип оперативної пам'яті DDR4 - 3200 МГц Накопичувачі даних Кількість слотів M.2 1 Кількість відсіків 2.5 SATA для HDD/SSD 1 Під'єднання Мережеві адаптери Wi - Fi 802.11ax(2x2) Bluetooth 5.2 " +
                          "Gigabit Ethernet Роз'єми та порти введення-виведення 1 x USB 3.1 Type - C Gen1 / 1 x USB 3.1 Gen1 / 1 х USB 2.0 / HDMI / LAN(RJ - 45) / комбінований аудіороз'єм для навушників/мікрофона/кардридер " +
                          "Безпровідний зв'язок Bluetooth 5.2 Wi - Fi 6 Відеокарта Обсяг пам'яті відеокарти 4 ГБ Відеокарта NVIDIA GeForce RTX 3050 Ti Короткі характеристики Екран 15.6 IPS (1920x1080) Full HD 144 Гц, матовий/AMD Ryzen 7 5800H (3.2 - 4.4 ГГц)/RAM 16 ГБ/SSD 512 ГБ/nVidia GeForce RTX 3050 Ті, 4 ГБ/без ОД/LAN/Wi-Fi/Bluetooth/вебкамера/DOS/1.98 кг/чорний " +
                          "Вид Ноутбуки Додаткові можливості Вебкамера True Vision 720p HD Вбудований мікрофон Аудіосистема B & O PLAY, два динаміки, технологія HP Audio Boost Країна - виробник Китай " +
                          "Комплект постачання Ноутбук Адаптер живлення Документація Гарантія 12 місяців",
                Image = @"https://content.rozetka.com.ua/goods/images/big/248528822.jpg",
                category = c1
            });
            db.Products.Add(new Product()
            {
                Name = "Samsung Galaxy M32 6/128 GB Light Blue (SM-M325FLBGSEK)",
                Price = 8999,
                Details = "Стандарт зв'язку/інтернет Стандарт зв'язку 2G(GPRS / EDGE) 3G(WCDMA / UMTS / HSPA) 4G(LTE) Дисплей Діагональ екрана 6.4 Роздільна здатність дисплея 2400 x 1080 " +
                          "Тип матриці Super AMOLED Частота оновлення екрана 90 Гц СІМ - картки Кількість SIM - карток 2 Розміри СІМ - картки Nano - SIM Функції пам'яті Оперативна пам'ять 6 ГБ Вбудована пам'ять 128 ГБ Операційна система Операційна система Android Фронтальна камера Кількість фронтальних камер " +
                          "1 Фронтальна камера 20 Мп Розміщення фронтальної камери Крапелька Запис відео фронтальної камери Full HD / 1920х1080 / стереозвук Додатково Апертура f / 2.2 Процесор " +
                          "Процесор Mediatek Процесор MediaTek Helio G80 Тип ядра Cortex - A75(64bit) + Cortex - A55(64bit) Відеоядро ARM Mali - G52 MC2 Кількість ядер 8 Модель Mediatek Helio G Серії Частота процесора " +
                          "2.0 ГГц + 1.8 ГГц Основна камера Основна камера 64 Мп + 8 Мп + 2 Мп + 2 Мп Особливості основної камери Автофокус Спалах Ультраширококутний об'єктив Кількість основних камер 4 Запис відео основної камери " +
                          "Full HD / 1920х1080 / стереозвук Додатково Основна камера 64 Мп(f / 1.8) Ультраширококутна камера 8 Мп(f / 2.2) Макрокамера 2 Мп(f / 2.4) Depth камера 2 Мп(f / 2.4) " +
                          "Живлення Ємність акумулятора 5000 мА·год Матеріали Матеріал корпуса Пластик Роз'єми Роз'єм зарядного пристрою Type - C Роз'єм для підключення до ПК Type - C " +
                          "Роз'єм для навушників 3.5 мм Навігація GPS - навігація BDS GPS ГЛОНАСС A - GPS Є Розміри Вага, г 180 Ширина 74 мм Висота 159.3 мм Глибина 8.4 мм Додатково " +
                          "Безпека Сканер відбитків пальців збоку Датчики Акселерометр Геомагнітний датчик Гіроскоп Датчик наближення Датчик освітлення  Загальні характеристики Комплект постачання " +
                          "Гарантійний талон  Документація Зарядний пристрій Кабель для синхронізації Скріпка для виймання СІМ - карти Телефон Бездротові технології 3.5 mm Mini - Jack Bluetooth 5.0 " +
                          "NFC USB Type - C Wi - Fi Оснащення Гіроскоп Форм - фактор Моноблок Особливості корпусу Безрамковий дисплей Колір Light Blue Формат підтримуваних карт пам'яті " +
                          "microSD Максимальний обсяг підтримуваної карти пам'яті 1 ТБ Країна - виробник товару Китай Гаряча лінія виробника Samsung 0 - 800 - 502 - 000 Цілодобово 24 / 7 " +
                          "Гарантія 12 місяців",
                Image = @"https://content2.rozetka.com.ua/goods/images/big/189581882.jpg",
                category = c2
            });
            db.Products.Add(new Product()
            {
                Name = "OnePlus Nord N10 5G 6/128 GB Midnight Ice (5011101341)",
                Price = 9999,
                Details = "Стандарт зв'язку/інтернет Стандарт зв'язку 2G(GPRS / EDGE) 3G(WCDMA / UMTS / HSPA) 4G(LTE) 5G Дисплей Діагональ екрана 6.49 Роздільна здатність дисплея" +
@"2400 x 1080
Тип матриці
IPS
Частота оновлення екрана
90 Гц
Матеріал екрана
Скло(Gorilla Glass 3)
СІМ - картки
Кількість SIM - карток
2
Розміри СІМ - картки
Nano - SIM
Функції пам'яті
Оперативна пам'ять
6 ГБ
Вбудована пам'ять
128 ГБ
Комбінований слот
Так
Операційна система
Операційна система
Android
Фронтальна камера
Кількість фронтальних камер
1
Фронтальна камера
16 Мп
Особливості фронтальної камери
Стабілізація
Фронтальний спалах
Розміщення фронтальної камери
Виріз
Вид фронтального спалаху
Програмний
Запис відео фронтальної камери
Full HD / 1920х1080 / стереозвук
Додатково
HDR / Ретушування обличчя
Метод стабілізації
Цифрова
Процесор
Процесор
Qualcomm Snapdragon
Процесор
Qualcomm Snapdragon 690
Тип ядра
Kryo 560
Відеоядро
Qualcomm Adreno 619L
Кількість ядер
8
Модель Snapdragon
Snapdragon 600 Серії
Частота процесора
2.0 ГГц
Основна камера
Основна камера
64 Мп + 8 Мп + 2 Мп + 2 Мп
Особливості основної камери
Автофокус
Підтримка знімання 4К
Спалах
Стабілізація
Ультраширококутний об'єктив
Кількість основних камер
4
Запис відео основної камери
4K / 3840x2160 / стереозвук
Додатково
Основна камера 64 Мп: f / 1.79
Ширококутний об'єктив 8 Мп: f/2.25/кут огляду 119°
Монохромний об'єктив 2 Мп: f/2.4
Макрооб'єктив 2 Мп: f/2.4
Метод стабілізації
Цифрова
Живлення
Ємність акумулятора
4300 мА·год
Роз'єми
Роз'єм зарядного пристрою
Type - C
Роз'єм для підключення до ПК
Type - C
Роз'єм для навушників
3.5 мм
Навігація
GPS - навігація
BDS
GPS
ГЛОНАСС
Цифровий компас
A - GPS
Є
Розміри
Вага,
                г
190
Ширина
74.7 мм
Висота
163 мм
Глибина
8.95 мм
Додатково
Безпека
Розблокування за обличчям
Сканер відбитків пальців ззаду
Датчики
Акселерометр
Барометр
Гіроскоп
Датчик наближення
Датчик освітлення
Компас
Загальні характеристики
Комплект постачання
Гарантійний талон
Документація
Зарядний пристрій
Кабель для синхронізації
Скріпка для виймання СІМ - карти
Телефон
Бездротові технології
3.5 mm Mini - Jack
Bluetooth 5.1
NFC
USB Type - C
Wi - Fi
Оснащення
Гіроскоп
Стереодинаміки
Швидке заряджання
Форм - фактор
Моноблок
Особливості корпусу
Безрамковий дисплей
Колір
Midnight Ice
Формат підтримуваних карт пам'яті
microSD
Максимальний обсяг підтримуваної карти пам'яті
512 ГБ
Країна - виробник товару
Китай
Гарантія
12 місяців",
                Image = @"https://content1.rozetka.com.ua/goods/images/big/201837380.jpg",
                category = c2
            });
            db.Products.Add(new Product()
            {
                Name = "Motorola Moto G60 6/128 GB Haze Gray (PANB0007RS)",
                Price = 9999,
                Details = @"Стандарт зв'язку/інтернет
                Стандарт зв'язку
                2G(GPRS / EDGE)
                3G(WCDMA / UMTS / HSPA)
                4G(LTE)
                Дисплей
                Діагональ екрана
                6.8
                Роздільна здатність дисплея
                2460 x 1080
                Тип матриці
                IPS
                Частота оновлення екрана
                120 Гц
                СІМ - картки
                Кількість SIM - карток
                2
                Розміри СІМ - картки
                Nano - SIM
                Функції пам'яті
                Оперативна пам'ять
                6 ГБ
                Вбудована пам'ять
                128 ГБ
                Операційна система
                Операційна система
                Android
                Фронтальна камера
                Кількість фронтальних камер
                1
                Фронтальна камера
                32 Мп
                Додатково
                f / 2.2,
                1.4 µm
                Процесор
                Процесор
                Qualcomm Snapdragon
                Процесор
                Qualcomm Snapdragon 732G
                Тип ядра
                Kryo 470
                Відеоядро
                Qualcomm Adreno 618
                Кількість ядер
                2 + 6
                Модель Snapdragon
                Snapdragon 700 Серії
                Частота процесора
                2.3 ГГц + 1.8 ГГц
                Основна камера
                Основна камера
                108 Мп + 8 Мп + 2 Мп
                Особливості основної камери
                Автофокус
                Спалах
                Кількість основних камер
                3
                Запис відео основної камери
                4K / 3840x2160 / стереозвук
                Додатково
                f / 1.9 | 2.1 µm | Ultra Pixel + 1.12um[f / 2.2] + 1.75μm[f / 2.4]
                Живлення
                Ємність акумулятора
                6000 мА·год
                Матеріали
                Матеріал корпуса
                Пластик
                Роз'єми
                Роз'єм зарядного пристрою
                Type - C
                Роз'єм для підключення до ПК
                Type - C
                Роз'єм для навушників
                3.5 мм
                Навігація
                GPS - навігація
                GPS
                ГЛОНАСС
                A - GPS
                Є
                Розміри
                Вага,
                г
                225
                Ширина
                75.9 мм
                Висота
                169.6 мм
                Глибина
                9.8 мм
                Додатково
                Безпека
                Сканер відбитків пальців ззаду
                Загальні характеристики
                Комплект постачання
                Документація
                Зарядний пристрій
                Кабель для синхронізації
                Телефон
                Бездротові технології
                Bluetooth 5.0
                NFC
                USB Type - C
                Wi - Fi
                Оснащення
                Швидке заряджання
                Форм - фактор
                Моноблок
                Особливості корпусу
                Безрамковий дисплей
                Колір
                Gray
                Формат підтримуваних карт пам'яті
                microSD
                Максимальний обсяг підтримуваної карти пам'яті
                1 ТБ
                Країна - виробник товару
                Китай
                Гарантія
                12 місяців",
                Image = @"https://content2.rozetka.com.ua/goods/images/big/220713124.jpg",
                category = c2
            });
            db.Products.Add(new Product()
            {
                Name = "Інфрачервоний нагрівач RZTK QH 1200",
                Price = 799,
                Details = @"Максимальна потужність
                1200 Вт
                Реком.площа відкритого майданчика(кв.м)
                12
                Типи режимів
                400 Вт
                800 Вт
                1200 Вт
                Площа обслуговування,
                кв.м
                15
                Потужність,
                Вт
                400
                800
                1200
                Додаткові характеристики
                Номінальна напруга: 230 В ± 10 %
                Номінальна частота струму: 50 - 60 Гц
                Тип нагрівального елемента: ніхромова спіраль у трубці з кварцового скла
                Кількість режимів нагрівання: 3
                Комплектація
                Інфрачервоний обігрівач
                Інструкція з експлуатації
                Габарити(ВхШхГ)
                25.5 х 50 х 12 см
                Монтаж
                Підлоговий
                Вага(кг)
                1
                Колір
                Сірий
                Різновид нагрівального елемента
                Кварцовий
                Тип теплоносія
                Електричні
                Призначення
                Побутовий
                Живлення
                Від мережі
                Керування
                Механічне
                Кількість режимів обігріву
                3
                Країна виробник
                Китай
                Гарантія
                24 місяці офіційної гарантії від ROZETKA
                Функції захисту
                Датчик перекидання
                Особливості
                Ручка для переміщення",
                Image = @"https://content.rozetka.com.ua/goods/images/big/231937054.jpg",
                category = c3
            });
            db.Products.Add(new Product()
            {
                Name = "Вбудована посудомийна машина HOTPOINT ARISTON HI 5020 WEF",
                Price = 16299,
                Details = @" Місткість комплектів
                14
                Вид
                Повногабаритна(60 см)
                Витрата води за цикл / рік
                9.5 / 2660 л
                Споживання електроенергії за цикл / рік
                0.934 / 266 кВт * год
                Спосіб встановлення
                Вбудована
                Потужність підключення
                1900 Вт
                Рівень шуму
                46 дБ
                Керування
                Електронне
                Тип сушіння
                Конденсаційна
                Кількість температурних режимів
                3
                Клас енергоспоживання
                A++
                Основні програми
                Еко Інтенсивна Тиха Дезінфекція Ополіскування Самоочищення Експрес Автоматична змішана
                Тип мотора
                Інверторний
                Індикатори
                Наявності ополіскувача
                Наявності солі
                Режимів роботи
                Датчики
                Завантаження
                Індикація часу
                Немає
                Додаткова інформація
                Active Dry - автоматичне відчинення дверцят у кінці циклу,
                підвищує ефективність сушіння та знижує енергоспоживання; 3D Zone wash -дає змогу на 40 % підвищити інтенсивність миття в одному з вибраних кошиків; Flexiload
                Комплектація
                Посудомийна машина
                Внутрішнє оснащення
                Інструкція з експлуатації
                Гарантійний талон

                Фасадна декоративна панель до комплекту не входить
                Габарити(ВхШхГ)
                82 х 59.8 х 55.5 см
                Розміри ніші для вбудовування(ВxШxГ)
                82 х 60 х 56 см
                Габарити упаковки(ВхШхГ)
                91 x 62.5 x 67.5 см
                Вага
                35.5 кг
                Вага в упаковці
                37.5 кг
                Колір корпусу
                Нержавіюча сталь
                Особливості
                Акустичний сигнал завершення програми
                Використання таблеток ""все в 1""
                Захист від протікання
                Під'єднання до гарячої води
                Режим половинного завантаження
                Таймер відстрочки старту
                Третій додатковий кошик
                Індикація
                Дисплей
                Клас мийки
                A
                Клас сушіння
                A
                Колір панелі керування
                Нержавіюча сталь
                Країна виробник
                Польща
                Гарантія
                12 місяців офіційної гарантії від виробника",
                Image = @"https://content1.rozetka.com.ua/goods/images/big/169012202.jpg",
                category = c3
            });
            db.SaveChanges();
        }
    }

}
